from asyncio import sleep
from datetime import datetime, timedelta
from random import choice

from aiogram import Bot

import pytz

from sqlalchemy import and_, delete, select

from config import settings

from ..database import async_session_maker
from ..models import Note, User


reminders = [
    "Сегодняшний день ждет своего рассказчика! ✨ Поделитесь одним ярким моментом, который запомнился вам сегодня.",
    "Ваш день — это история, и только вы можете ее рассказать 📖 Уделите минуту, чтобы сохранить сегодняшнюю главу.",
    "Каждый день — это маленькая жизнь. Не дайте ей пройти незамеченной! 🌅 Чем запомнился сегодняшний день?",
    "Минуты складываются в дни, дни — в воспоминания. Остановите мгновение! ⏳ Что сегодня заставило вас улыбнуться?",
    "Вселенная ждет вашей сегодняшней истории 🌌 Опишите один момент, который сделал этот день особенным.",
    "Не пропустите день в вашей летописи! 📝 Всего пару предложений о том, как прошел ваш день.",
    "Ваша будущая версия скажет вам спасибо! 👵👴 Через год вы с теплотой вспомните сегодняшний день.",
    "Создавайте историю своего года день за днем! 🗓️ Сегодняшний кусочек пазла еще не на своем месте.",
    "День подходит к концу, но еще не поздно его сохранить 🌙 О чем вы думали сегодня? Что чувствовали?",
    "Ваш персональный архив ждет пополнения! 🗂️ Даже обычный день может стать ценным воспоминанием.",
    "Осторожно: сегодняшний день может исчезнуть из памяти! 🚨 Срочно сохраните 3 факта о вашем дне.",
    "Квест дня: зафиксировать один хороший момент! 🎮 Какой момент сегодня заслуживает места в вашей хронике?",
    "Ваш день хотел бы быть упомянутым в вашем журнале 😊 Подарите ему эту возможность!",
    "Соберите коллекцию дней! Сегодняшний экспонат еще не в вашей коллекции 🏺",
    "Бонусное задание: опишите свой день в 3-х словах или больше 🏆 Что было самым значимым?",
    "Время течет, но записи остаются 🕰️ Какой след оставил сегодняшний день в вашей жизни?",
    "Пауза для осознанности: остановитесь и вспомните, как прошел ваш день 🧘‍♀️ Что вы узнали о себе сегодня?",
    "Каждый день меняет вас немного. Зафиксируйте это изменение! 🔄 Чем сегодняшний вы отличается от вчерашнего?",
    "Ваша жизнь — это сумма дней. Не теряйте ни одного слагаемого ➕ Что добавил сегодняшний день?",
    "Даже самый обычный день уникален и неповторим 🌈 Что сделало сегодняшний день именно таким, какой он есть?",
]


async def note_remind(bot: Bot) -> None:
    tz = pytz.timezone("Europe/Moscow")
    now = datetime.now(tz)
    today = now.replace(hour=0, minute=0, second=0, microsecond=0, tzinfo=None)
    async with async_session_maker() as session:
        stmt = (
            select(User)
            .outerjoin(
                Note,
                and_(
                    User.id == Note.user_id,
                    Note.created_at >= today,
                    Note.created_at < (today + timedelta(days=1)),
                ),
            )
            .where(Note.id.is_(None))
            .distinct()
        )

        res = await session.execute(stmt)

        will_deleted = []

        for user in res.scalars():
            try:
                await bot.send_message(
                    chat_id=user.id,
                    text=choice(reminders),
                )
                await sleep(0.2)
            except Exception:
                await bot.send_message(
                    chat_id=settings.ADMIN,
                    text=f"Пользователь {user.first_name + ' ' + user.last_name if user.last_name is not None else user.first_name} заблрокировал бота :(",
                )
                will_deleted.append(user.id)

        stmt = delete(User).where(User.id.in_(will_deleted))
        await session.execute(stmt)
        await session.commit()
